#+title: (Supplementary) NumPy Tutorial
#+HTML_MATHJAX: align: left indent: 2em
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../myStyle.css" />
#+OPTIONS: html-style:nil H:2 toc:2 num:nil tasks:nil
#+HTML_LINK_HOME: ../toc.html
NumPy is a Python library for scientific computing. This means
different things to different people, but in the context of CS132,
NumPy is a library for doing linear algebra in Python.

One thing I want to emphasize: for the things we do in CS132, we don't
/have/ to use NumPy. We could in principle implement everything that
we need in vanilla Python using 2D Python lists (i.e., lists of
lists). There isn't much to learn about NumPy except the names of
functions and a couple conventions. That is to say: if you know how to
program in Python using 2D lists, then the jump to using NumPy is a
small one.

Why, then, do we use NumPy?
- Even though we /could/ write all the functions we need ourselves,
  it's nice when we don't have to.
- Even if we /did/ write all the functions we need ourselves, our
  implementations would almost certainly not be as fast as the ones in
  the NumPy library.
- Its a useful skill to have since its a widely used library.
* NumPy Arrays
The fundamental object of NumPy is the ~ndarray~. The ~nd~ part refers
to "n-dimensional." We will only ever consider 1D or 2D arrays, but
NumPy can support any number of dimensions (e.g., if a matrix is a
rectangle of numbers, a 3D array is a rectangular prism of
numbers).

~ndarray~ objects are similar to Python lists, and it's common to
construct ~ndarray~ objects from Python lists using the constructor
~array~:

#+begin_src python
  np.array([1, 2, 3, 4, 5])
#+end_src

They differ quite a bit from Python lists /internally/, but as we will
use them, they really only differ in some of their properties and
operations, which we will cover throughout this tutorial.

We will be constructing almost exclusively 1D and 2D ~ndarray~ objects
(which I will call NumPy arrays moving forward). A 1D NumPy array can
be constructed from a 1D Python list as above. A 2D NumPy array can be
constructed from a 2D Python list (i.e., a list of lists).

#+begin_src python :results output :exports both
  import numpy as np

  a = np.array([[1, 2], [3, 4], [5, 6]])
  print(a)
#+end_src

#+RESULTS:
: [[1 2]
:  [3 4]
:  [5 6]]

Since NumPy arrays are optimized for use in linear algebra, it's not
possible to construct a NumPy array from a Python list that cannot be
interpreted as a matrix, i.e., when one of it's elements is not a
list, or not the same length as the others.

#+begin_src python :results output :exports both
  import numpy as np
  try:
      a = np.array([1, [2, 3], [4, 5]])
  except:
      print("No dice")
  try:
      a = np.array([[1, 2], [3, 4], [5, 6, 7]])
  except:
      print("No dice")
#+end_src

#+RESULTS:
: No dice
: No dice

We can use the ~ndim~ property to determine the dimension an NumPy array.

#+begin_src python :session
  a = np.array([1, 2, 3, 4, 5, 6])
  b = np.array([[1, 2], [3, 4], [5, 6]])

  assert(a.ndim == 1)
  assert(b.ndim == 2)
#+end_src

#+RESULTS:

Roughly speaking, we will use 1D numpy arrays to represent (column)
vectors and 2D numpy arrays to represent matrices.

#+begin_quote
*Important.* This is often confusing at first because we get used to
thinking of column vectors as a special kind of matrix, and because 1D
numpy arrays are displayed horizontally (as a row) instead of
vertically (as a column). This is something we have to come to terms
with.
#+end_quote

